# config/settings.py

''' Файл с параметрами применямыми к модели '''
import pandas as pd
import datetime as dt

# =========================================
# ✅ Прогноз. Обучать + Прогнозировать можно с начала до конца месяца (подумать как будет лучше)
# =========================================
START_FORECAST_DATE = pd.Timestamp(dt.date.today())
MAX_HISTORY_DAYS = 500

# ====================================================
# Размер окна тренировочный данных (дней) (прогон на выбранных и выбор лучшего окна для каждой метрики и канала)
# ======================================================
TRAIN_WINDOWS = [60, 90, 120]

# =========================================
# OUTPUT FILES:
# 1. Сохранение найденных лучшего окна и модели для метрики + канала продаж
# 2. Формирование excel отчета для анализа.
# =========================================
POLICY_FILE = 'policy_model.json'
EXCEL_REPORT_FILE = 'forecast_report.xlsx'

# =============================================================================
# МОДЕЛИ ДЛЯ BACKTEST. По каким будут бэктесты проводиться на выбор лучшей ?
# =============================================================================
MODELS_TO_RUN = [
    "BASELINE_OLS",
    # "BASELINE_EXPON",
    # "BASELINE_HOLT",
    # "BASELINE_HOLT_WINTERS",
    "BASELINE_RF",
    "CATBOOST_RECURSIVE",
    #"CATBOOST_DIRECT",
    #"LIGHTGBM_DIRECT",
    # "LIGHTGBM_RECURSIVE",
    # "XGB_DIRECT"
]

BACKTEST_DATES = [
    # pd.Timestamp("2025-08-01"),
    # pd.Timestamp("2025-08-10"),
    # pd.Timestamp("2025-08-20"),
    # pd.Timestamp("2025-09-01"),
    # pd.Timestamp("2025-09-10"),
    # pd.Timestamp("2025-09-20"),
    pd.Timestamp("2025-10-01"),
    pd.Timestamp("2025-10-10"),
    pd.Timestamp("2025-10-20"),
    pd.Timestamp("2025-11-01"),
    pd.Timestamp("2025-11-10"),
    pd.Timestamp("2025-11-20"),
    pd.Timestamp("2025-12-01"),
    pd.Timestamp("2025-12-10"),
    pd.Timestamp("2025-12-20"),
]

# Какие каналы прогоняем (дистры плоховато прогнозируются, пока не разбирался почему). Каналы КП и ТД можно взять
KP_DISTR_PAIRS = [
    ("КП РЕГИОН А", "БЕЗ ИРИС"),
    ("КП РЕГИОН А", "ИРИС"),
    ("КП РЕГИОН Б", "БЕЗ ИРИС"),
    ("КП РЕГИОН Б", "ИРИС"),
    # ("Дистрибьюторские продажи", "БЕЗ ИРИС"),
    # ("Дистрибьюторские продажи", "ИРИС"),
    ]

TD_PAIRS = [
    # ("РСС", "БЕЗ ИРИС"),
    # ("РСС", "БЕЗ ИРИС"),
    ]

# Какие таргеты прогнозируем
METRICS = [
    "SUM_SNDS",
    "SUM_PROFIT",
    "SUM_PROFIT_NO_KSP",
    ]